In [1]:
import pandas as pd

In [2]:
emp = pd.read_csv('employees.csv')

In [3]:
emp.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

In [4]:
emp.shape

(1000, 8)

In [5]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

In [6]:
emp['First Name'].unique()

array(['Douglas', 'Thomas', 'Maria', 'Jerry', 'Larry', 'Dennis', 'Ruby',
       nan, 'Angela', 'Frances', 'Louise', 'Julie', 'Brandon', 'Gary',
       'Kimberly', 'Lillian', 'Jeremy', 'Shawn', 'Diana', 'Donna', 'Lois',
       'Matthew', 'Joshua', 'John', 'Craig', 'Scott', 'Terry', 'Benjamin',
       'Christina', 'Joyce', 'Jean', 'Theresa', 'Rachel', 'Linda',
       'Stephanie', 'Michael', 'Christine', 'Beverly', 'Marilyn',
       'Cynthia', 'Roger', 'Bruce', 'Kathy', 'Clarence', 'Chris', 'Nancy',
       'Todd', 'Alan', 'Sara', 'Karen', 'Carl', 'Henry', 'Irene', 'Paula',
       'Denise', 'Kathleen', 'Steve', 'Jose', 'Johnny', 'Bobby', 'Bonnie',
       'Margaret', 'Charles', 'Robin', 'Gerald', 'Christopher', 'Steven',
       'Doris', 'Annie', 'Janice', 'James', 'Virginia', 'Harry',
       'Heather', 'Laura', 'Tina', 'Harold', 'Melissa', 'Aaron', 'Jack',
       'Phyllis', 'Paul', 'Russell', 'Shirley', 'Willie', 'Ashley',
       'Pamela', 'Andrea', 'Peter', 'Helen', 'Patricia', 'Michelle',
       'William', 'Kenneth', 'Antonio', 'Rebecca', 'Carlos', 'Carolyn',
       'Gloria', 'Adam', 'Elizabeth', 'Teresa', 'Nicole', 'Jennifer',
       'Philip', 'Patrick', 'Sean', 'Ruth', 'Victor', 'Marie', 'Howard',
       'Norma', 'Arthur', 'Mary', 'Wayne', 'Jane', 'Jessica', 'Mark',
       'Randy', 'Sandra', 'Carol', 'Barbara', 'Ronald', 'Jonathan',
       'Katherine', 'Emily', 'Lisa', 'Evelyn', 'Gregory', 'Billy',
       'Jason', 'Daniel', 'Sarah', 'George', 'Diane', 'Kathryn', 'Cheryl',
       'Kevin', 'Walter', 'Robert', 'Jimmy', 'Fred', 'Brenda', 'Justin',
       'Betty', 'Sharon', 'Ralph', 'Edward', 'Debra', 'Anne', 'Roy',
       'Frank', 'Nicholas', 'Judy', 'Tammy', 'Jesse', 'Joan', 'Ernest',
       'Jacqueline', 'Jeffrey', 'Samuel', 'Earl', 'Richard', 'Lori',
       'Susan', 'Juan', 'Albert', 'Stephen', 'Rose', 'Joe', 'Julia',
       'Dorothy', 'Deborah', 'Alice', 'Wanda', 'Lawrence', 'Amy', 'Ryan',
       'Judith', 'Eugene', 'Donald', 'Ann', 'Raymond', 'Catherine',
       'Amanda', 'Anna', 'Joseph', 'Andrew', 'Kelly', 'Louis', 'Mildred',
       'Eric', 'Timothy', 'Anthony', 'Martha', 'Brian', 'Martin', 'Janet',
       'Keith', 'Phillip', 'David'], dtype=object)

In [7]:
emp['Gender'].unique()

array(['Male', 'Female', nan], dtype=object)

In [8]:
emp['Start Date'].unique()

array(['8/6/1993', '3/31/1996', '4/23/1993', '3/4/2005', '1/24/1998',
       '4/18/1987', '8/17/1987', '7/20/2015', '11/22/2005', '8/8/2002',
       '8/12/1980', '10/26/1997', '12/1/1980', '1/27/2008', '1/14/1999',
       '6/5/2016', '9/21/2010', '12/7/1986', '10/23/1981', '7/22/2010',
       '4/22/1995', '9/5/1995', '3/8/2012', '6/14/2012', '7/1/1992',
       '10/8/2012', '2/27/2000', '7/11/1991', '11/27/1981', '1/26/2005',
       '8/6/2002', '2/20/2005', '8/21/1998', '12/18/1993', '1/10/2004',
       '10/10/2006', '2/16/2009', '10/19/1981', '9/13/1986', '1/29/2016',
       '10/10/2008', '6/28/2015', '9/9/1998', '12/7/1980', '11/16/1988',
       '4/17/1980', '11/28/2009', '6/22/2005', '3/26/1996', '1/24/1980',
       '9/23/2000', '12/17/2011', '2/18/1990', '3/3/2014', '8/15/2007',
       '11/30/1999', '5/3/2006', '6/26/1996', '4/11/2010', '5/7/1997',
       '11/23/2005', '11/6/2001', '6/12/2007', '1/2/2013', '4/11/1990',
       '11/11/2009', '12/15/2012', '8/16/1999', '10/30/2004', '7/14/2015',
       '6/10/2003', '11/6/2009', '5/7/2007', '4/4/1999', '6/4/1995',
       '7/2/1991', '9/10/1988', '9/14/2004', '6/4/1983', '11/13/1988',
       '3/17/1995', '3/30/2008', '3/30/1980', '9/23/2005', '8/20/2004',
       '2/1/2008', '9/29/2007', '1/30/1993', '11/27/1991', '3/12/2016',
       '8/21/1997', '5/25/2000', '5/7/1994', '8/26/1981', '7/11/1998',
       '3/21/1994', '7/19/2014', '6/16/2016', '1/2/1985', '6/21/2005',
       '2/17/2012', '1/12/1997', '10/11/1996', '12/23/1989', '3/9/1996',
       '8/4/1993', '4/23/2013', '5/5/1988', '4/22/2000', '6/20/2001',
       '12/17/1999', '11/27/2003', '6/12/2009', '8/4/2002', '7/1/1982',
       '6/22/1991', '3/1/1995', '1/12/2012', '6/3/2008', '11/17/1994',
       '5/9/2016', '4/13/2012', '11/29/2001', '11/16/1983', '9/1/2003',
       '3/30/1984', '9/29/2002', '8/25/1987', '10/25/1988', '5/1/1984',
       '7/10/1992', '1/4/1995', '12/25/1987', '4/9/2011', '6/29/2007',
       '4/24/1995', '5/21/2011', '5/25/2006', '10/3/1990', '2/28/1981',
       '12/24/1990', '10/9/2003', '1/28/2016', '3/5/1982', '4/4/2009',
       '11/25/1992', '7/17/2008', '7/14/1991', '8/17/2014', '5/4/1996',
       '11/3/1997', '8/19/1999', '3/10/2011', '11/15/1980', '3/16/2003',
       '4/27/1992', '7/27/2005', '2/28/1999', '11/22/1983', '3/18/2000',
       '8/22/1999', '4/13/1998', '9/3/1990', '8/13/1999', '3/23/2014',
       '7/9/1991', '12/24/2011', '9/3/1987', '11/4/1996', '1/29/1992',
       '8/17/2007', '9/23/1991', '12/21/2008', '9/18/2007', '2/17/1998',
       '1/8/2003', '4/7/2012', '9/3/1997', '10/23/1995', '4/12/2008',
       '11/14/1999', '6/19/1999', '5/18/1999', '12/18/2003', '1/19/1983',
       '2/23/2005', '11/19/2004', '10/14/2000', '5/2/1998', '3/19/1996',
       '10/18/2013', '5/3/2003', '2/18/1995', '1/30/2004', '4/30/2014',
       '11/10/1985', '11/6/2012', '12/27/1990', '7/17/2009', '8/12/1987',
       '7/15/1997', '11/8/1982', '1/4/2013', '6/6/2006', '3/27/2006',
       '12/6/2012', '10/12/1987', '9/20/2007', '8/12/1986', '6/24/2006',
       '11/2/2009', '5/24/1980', '7/23/1989', '5/30/2009', '7/31/2013',
       '9/3/1999', '6/15/1992', '3/13/1995', '6/17/1991', '1/29/2000',
       '10/17/1999', '4/30/2010', '9/14/1995', '10/1/2015', '4/19/1995',
       '4/13/1999', '9/23/1994', '6/8/2000', '2/24/1988', '4/18/1993',
       '4/4/1997', '2/4/2004', '2/4/1982', '2/11/2015', '4/2/2006',
       '9/23/2008', '3/25/1982', '5/12/2016', '4/21/1984', '7/6/1983',
       '10/27/1990', '10/7/1986', '10/8/1996', '4/11/1991', '12/2/1984',
       '7/27/2010', '12/6/1992', '6/12/2002', '2/6/1986', '3/1/1990',
       '11/11/2004', '4/28/2003', '5/27/1985', '3/20/2009', '3/13/1998',
       '11/25/1999', '1/24/2002', '2/6/1995', '3/27/2007', '8/6/1995',
       '7/16/1986', '11/21/1985', '3/24/1983', '9/23/2004', '8/5/2009',
       '2/4/2005', '3/3/1982', '8/2/1992', '4/6/2011', '11/20/2001',
       '2/20/1980', '4/12/1994', '10/5/1982', '2/22/1994', '7/3/1989',
       '5/29/1991', '6/28/2005', '11/8/2000', '7/12/1997', '1/1/2014',
       '2/7/2014', '3/11/2009', '10/6/2005', '9/16/1997', '2/2/1984',
       '11/9/2011', '12/21/1999', '9/27/1985', '6/14/1988', '11/11/1984',
       '3/7/2000', '10/25/1999', '10/20/1999', '3/2/1981', '11/10/1996',
       '9/15/2007', '8/30/2004', '1/13/1988', '6/26/1988', '7/11/2015',
       '7/5/2007', '7/25/1980', '8/12/1981', '2/6/1993', '4/1/1984',
       '9/26/1981', '9/8/2009', '9/11/1984', '2/20/1990', '1/18/2002',
       '4/16/2001', '7/1/1991', '9/1/1995', '10/3/2013', '12/18/2013',
       '8/6/2006', '11/25/1981', '7/8/2008', '3/23/1986', '1/8/2002',
       '12/16/1990', '12/10/1988', '1/2/2005', '6/18/1997', '1/29/1994',
       '12/19/1991', '1/27/2010', '3/16/2014', '9/3/1983', '2/13/1987',
       '6/8/1986', '5/23/2011', '11/18/2014', '1/22/2007', '1/5/2000',
       '9/27/2005', '11/22/1991', '5/12/2009', '9/19/2007', '10/20/2011',
       '2/24/2009', '11/21/2006', '11/22/1998', '3/31/1988', '8/2/1989',
       '11/24/2005', '8/31/1995', '12/3/2012', '10/9/2011', '4/22/1997',
       '11/10/2005', '9/14/2003', '2/1/1990', '8/13/2014', '5/22/1994',
       '9/25/2004', '5/5/2014', '11/9/2009', '4/15/2005', '4/16/2002',
       '7/19/1983', '1/24/1989', '8/4/1989', '12/17/1982', '10/18/2009',
       '7/15/2009', '8/27/2003', '2/1/1997', '12/31/2006', '7/9/2011',
       '10/16/2015', '4/9/1987', '10/30/1994', '9/18/2002', '7/15/2001',
       '8/3/1996', '4/18/1996', '7/28/2010', '12/24/1980', '1/19/2010',
       '1/15/1995', '10/29/1994', '9/19/1989', '10/28/1984', '4/26/2001',
       '8/15/1989', '10/27/2010', '12/5/1996', '1/8/1998', '11/25/2001',
       '7/6/2002', '1/13/2005', '7/29/1992', '6/9/1988', '3/16/2004',
       '4/16/1996', '11/28/1992', '2/8/1984', '7/20/1990', '3/9/2014',
       '8/22/2010', '2/23/2002', '12/5/2010', '5/29/1994', '8/14/2012',
       '6/23/1981', '2/11/2007', '9/14/1992', '8/18/2011', '11/16/1990',
       '6/29/2008', '8/31/1981', '3/2/1982', '11/5/2013', '5/22/1986',
       '11/20/1986', '9/24/2005', '11/25/1980', '6/9/2003', '5/2/1986',
       '3/16/2016', '1/10/1981', '5/13/1999', '5/28/2015', '10/1/2010',
       '12/16/1999', '3/7/2015', '7/20/2008', '2/7/1995', '12/1/2006',
       '8/29/2007', '3/18/2001', '11/20/1998', '3/1/2013', '7/22/1990',
       '5/13/2003', '4/23/1998', '5/8/1987', '5/24/2016', '12/12/2006',
       '8/16/1994', '5/15/2009', '1/30/1992', '11/30/2005', '8/22/2009',
       '7/15/2016', '11/17/2012', '12/19/1994', '2/21/1995', '10/24/2000',
       '2/3/1983', '1/9/2015', '9/30/2007', '3/1/1987', '1/17/2005',
       '8/9/2001', '4/14/1996', '7/11/2002', '5/13/2005', '10/31/1997',
       '8/4/2007', '6/19/2002', '6/28/1997', '5/9/2015', '7/20/1993',
       '3/12/2002', '7/10/1984', '8/20/1992', '8/15/2002', '11/26/1992',
       '10/25/1996', '8/14/2008', '5/22/2011', '7/4/1997', '4/27/2013',
       '5/3/1995', '4/26/1992', '4/14/2000', '8/15/1997', '4/9/2012',
       '12/3/2014', '3/11/2007', '7/1/2011', '11/23/2007', '9/9/1989',
       '1/30/1995', '11/1/2005', '3/21/2002', '5/24/1984', '2/26/2016',
       '5/5/2013', '6/13/1994', '12/10/1980', '2/1/2003', '2/11/2013',
       '11/3/1980', '8/3/2015', '6/24/2014', '4/20/1980', '7/14/1995',
       '11/3/2015', '11/23/1996', '11/4/1984', '4/27/2003', '7/4/1983',
       '4/6/1993', '11/19/2013', '12/25/1984', '1/8/1999', '4/12/1992',
       '12/12/1996', '1/19/1995', '2/22/2003', '9/25/1981', '8/31/2013',
       '7/5/1982', '10/13/2014', '8/22/1995', '3/22/2004', '12/2/1993',
       '8/26/1983', '4/23/2014', '6/13/2014', '5/2/2010', '2/26/2005',
       '2/11/2014', '1/8/1992', '9/18/1981', '8/26/1982', '9/14/1991',
       '10/8/2010', '9/6/1999', '12/2/2009', '5/1/1999', '8/1/2004',
       '4/15/2008', '7/3/2010', '2/4/1999', '9/10/1992', '9/22/1998',
       '1/2/1984', '2/25/1980', '6/18/1984', '7/18/1985', '9/2/1991',
       '6/7/2002', '10/25/1985', '10/26/1996', '12/16/2014', '6/1/1994',
       '8/18/1985', '11/17/1999', '12/3/2009', '9/20/1996', '10/7/1983',
       '5/2/2002', '3/29/1985', '8/9/2006', '1/8/1995', '4/1/1980',
       '4/18/1986', '7/7/1980', '8/16/1996', '4/6/1995', '1/13/1996',
       '12/30/1981', '1/13/2009', '1/22/1995', '7/30/1993', '5/4/2003',
       '3/17/1982', '10/18/2010', '1/27/1985', '1/28/1990', '11/19/1982',
       '2/2/1988', '5/30/2012', '4/16/1988', '7/23/1982', '5/23/1980',
       '4/22/1988', '5/24/1981', '11/23/2000', '4/15/2011', '5/7/1985',
       '10/3/1984', '6/24/1987', '7/21/2001', '10/11/1990', '12/20/1994',
       '6/15/1980', '7/21/2003', '10/26/1991', '3/15/2013', '5/20/1982',
       '2/21/1981', '10/13/1983', '10/24/1993', '2/16/2010', '2/16/1981',
       '10/21/2000', '1/3/1992', '11/12/2004', '8/30/2001', '12/6/1986',
       '1/14/2001', '11/24/1992', '10/22/1990', '3/7/2012', '8/10/1997',
       '6/23/2005', '11/29/2006', '11/26/1997', '6/29/2015', '4/13/1997',
       '11/21/1984', '9/2/1988', '3/12/1983', '7/13/1988', '3/6/2008',
       '2/23/1990', '11/17/2011', '3/30/1987', '9/27/2000', '7/2/1984',
       '9/2/2009', '11/12/1996', '8/11/1991', '8/28/2004', '1/25/1995',
       '3/16/2010', '9/29/1987', '8/13/1996', '3/13/1985', '2/21/2010',
       '4/6/1988', '11/15/1999', '2/17/2004', '7/5/1986', '12/5/2009',
       '5/28/2006', '12/14/1984', '9/24/2007', '2/9/1982', '3/5/2000',
       '10/19/1986', '8/27/2009', '12/24/1986', '8/21/1995', '12/19/2000',
       '8/31/1989', '10/6/2010', '2/13/2013', '2/4/2009', '12/5/2001',
       '3/28/1982', '9/14/2001', '7/12/2000', '11/5/1982', '3/24/1996',
       '8/28/2012', '10/30/2009', '6/6/1992', '9/20/1994', '4/17/1984',
       '9/11/2002', '6/17/1992', '11/23/2002', '4/23/2000', '12/20/2005',
       '1/21/2016', '10/20/1989', '2/18/2011', '12/27/1996', '4/7/2007',
       '5/8/1980', '1/28/2007', '10/2/2007', '5/15/2007', '10/16/1995',
       '11/12/2011', '4/6/1999', '5/25/2012', '5/23/1990', '8/2/2002',
       '5/19/1984', '3/2/2009', '9/16/2005', '3/17/2011', '5/31/2004',
       '9/7/1991', '9/23/2015', '7/4/1993', '3/7/1998', '1/11/2002',
       '4/7/1995', '11/27/1997', '1/9/2014', '2/6/2001', '9/28/1994',
       '7/30/1984', '3/22/1982', '6/15/1993', '4/15/1988', '10/21/2010',
       '1/29/1999', '4/8/1983', '4/16/2010', '6/27/1997', '9/5/1992',
       '12/10/2001', '5/19/1991', '2/29/2016', '5/10/2004', '10/8/2008',
       '9/7/1986', '4/26/2009', '7/16/2001', '5/12/1986', '6/17/2009',
       '12/18/1994', '11/26/2002', '4/5/2011', '7/23/2011', '10/10/2010',
       '1/25/1981', '5/9/2009', '7/10/1999', '2/25/2016', '5/30/1980',
       '7/15/2011', '2/16/2008', '8/19/2004', '6/30/2001', '7/17/1997',
       '1/25/1986', '2/5/1983', '8/6/1999', '2/23/2007', '6/6/1999',
       '4/11/2007', '2/19/1984', '10/21/1984', '4/12/1988', '8/18/2007',
       '9/2/1980', '12/29/2006', '3/31/2015', '11/10/2004', '7/27/2008',
       '5/2/1988', '4/23/1995', '7/25/1991', '7/12/2008', '3/26/2004',
       '10/7/2002', '9/22/2006', '5/22/1991', '8/14/2009', '10/24/1986',
       '6/18/2000', '11/3/1999', '9/30/2004', '4/20/1986', '12/28/2003',
       '9/8/1984', '7/5/2009', '7/3/1995', '5/6/1986', '4/15/1991',
       '9/14/1982', '7/24/1982', '9/7/1989', '7/1/2005', '3/31/2012',
       '7/8/2000', '3/3/1989', '11/4/1982', '7/22/1999', '3/1/2004',
       '10/7/1995', '8/31/1986', '12/31/1982', '10/1/1984', '12/12/1986',
       '8/5/1989', '1/12/1992', '7/28/2012', '3/17/2008', '5/3/1990',
       '1/29/2008', '11/6/2011', '3/8/1980', '9/27/1995', '2/10/2000',
       '9/3/1989', '12/13/1994', '2/10/2002', '6/23/2011', '1/18/1986',
       '3/17/2007', '5/31/2008', '10/3/1980', '12/14/1985', '11/18/1993',
       '12/27/1980', '2/26/2009', '11/12/2009', '8/18/2014', '12/4/2000',
       '8/1/1988', '7/16/2014', '7/12/2006', '1/14/2007', '8/31/2002',
       '1/15/2015', '2/12/2003', '5/28/2010', '2/11/1982', '3/17/2004',
       '5/23/1985', '4/6/2000', '7/25/2001', '8/26/2002', '8/13/2006',
       '2/7/1998', '2/26/1982', '6/19/1985', '1/3/1981', '9/10/1990',
       '5/2/1981', '6/5/1984', '9/6/1997', '8/19/1996', '4/6/2007',
       '2/10/1985', '10/20/2003', '1/18/2006', '12/8/1993', '4/25/2006',
       '10/1/2012', '10/7/1984', '3/26/1989', '5/25/1983', '5/15/1984',
       '11/16/2012', '8/29/1997', '8/25/2004', '6/15/2013', '8/18/2013',
       '8/3/1995', '11/19/1996', '3/29/2003', '1/18/2015', '5/1/1998',
       '9/8/1994', '4/11/1998', '9/11/1992', '9/5/1980', '5/25/2003',
       '5/20/2009', '5/25/2007', '1/28/1980', '10/27/1995', '10/17/2003',
       '10/6/1993', '1/30/2014', '10/8/2007', '1/4/2001', '11/24/2015',
       '8/25/1991', '7/27/2013', '11/19/2002', '11/19/1991', '3/10/2010',
       '2/28/1994', '4/27/2012', '5/21/1992', '6/23/2002', '10/10/1995',
       '5/23/2001', '7/29/1983', '2/9/2013', '5/16/2014', '7/27/1998',
       '12/17/2009', '8/1/1991', '10/22/2002', '7/7/2010', '12/8/1998',
       '12/11/2015', '9/28/2001', '1/4/1983', '1/16/1996', '3/13/2008',
       '4/27/1999', '3/21/2009', '1/2/2002', '6/5/2015', '12/5/2013',
       '2/28/1991', '11/11/2003', '8/23/2000', '3/11/2005', '9/20/1986',
       '4/27/2001', '9/10/2001', '6/23/2012', '12/23/2008', '7/5/1993',
       '8/7/1997', '3/23/1996', '3/14/2003', '1/22/1986', '9/9/2006',
       '7/28/1995', '9/28/1990', '6/26/1997', '11/20/2015', '9/8/2006',
       '5/10/2006', '4/15/1989', '9/15/1985', '7/30/2012', '3/31/2006',
       '8/20/2011', '5/21/1983', '9/14/2010', '1/22/2013', '2/25/2012',
       '1/19/1980', '10/17/1986', '2/3/1984', '10/24/1987', '9/19/1992',
       '10/29/1989', '6/18/1989', '8/21/2013', '5/7/1980', '9/25/1989',
       '8/16/2011', '3/27/1995', '2/4/2010', '9/3/1988', '12/30/2002',
       '7/28/2006', '5/10/2013', '8/30/2011', '10/19/1992', '12/4/1995',
       '1/17/1983', '7/20/2013', '1/26/2013', '1/15/1993', '4/6/1982',
       '12/23/1982', '10/15/2011', '7/10/1983', '11/26/1982', '12/8/2014',
       '10/5/2004', '2/10/1991', '7/24/1987', '8/25/2002', '10/16/2011',
       '5/15/1997', '6/21/2013', '11/23/2014', '1/31/1984', '5/20/2013',
       '4/20/2013', '5/15/2012'], dtype=object)

In [9]:
emp['Last Login Time'].unique()

array(['12:42 PM', '6:53 AM', '11:17 AM', '1:00 PM', '4:47 PM', '1:35 AM',
       '4:20 PM', '10:43 AM', '6:29 AM', '6:51 AM', '9:01 AM', '3:19 PM',
       '1:08 AM', '11:40 PM', '7:13 AM', '6:09 AM', '5:56 AM', '7:45 PM',
       '10:27 AM', '3:48 AM', '7:18 PM', '2:12 AM', '1:58 AM', '4:19 PM',
       '10:08 PM', '1:12 AM', '7:45 AM', '6:58 PM', '6:30 PM', '10:06 PM',
       '1:19 PM', '2:40 PM', '2:27 PM', '9:07 AM', '12:56 PM', '8:47 PM',
       '8:49 PM', '1:52 AM', '2:33 AM', '11:25 AM', '8:26 PM', '3:16 AM',
       '6:54 PM', '11:32 AM', '10:47 PM', '4:51 AM', '5:57 AM',
       '12:13 PM', '8:05 AM', '8:29 AM', '2:41 AM', '1:28 PM', '9:23 AM',
       '7:46 AM', '5:55 PM', '1:44 AM', '7:18 AM', '9:32 AM', '2:01 PM',
       '12:03 PM', '5:25 PM', '10:33 PM', '6:46 PM', '11:44 PM',
       '11:57 PM', '1:39 PM', '4:31 PM', '2:26 PM', '4:23 PM', '10:01 AM',
       '2:24 PM', '1:27 AM', '8:13 PM', '3:15 PM', '3:30 PM', '12:50 AM',
       '10:52 AM', '9:20 PM', '2:55 AM', '5:51 AM', '8:50 AM', '12:11 AM',
       '2:05 AM', '1:59 PM', '12:40 AM', '5:12 AM', '11:00 PM', '5:45 PM',
       '5:58 PM', '3:16 PM', '2:17 PM', '8:34 AM', '9:23 PM', '7:47 PM',
       '9:40 PM', '6:33 AM', '10:20 AM', '9:30 PM', '7:01 AM', '4:33 AM',
       '7:25 PM', '10:12 PM', '7:57 AM', '10:15 AM', '10:39 PM',
       '3:12 PM', '6:21 AM', '7:16 AM', '11:00 AM', '8:58 PM', '3:03 PM',
       '5:43 AM', '3:05 PM', '6:15 PM', '8:55 AM', '2:04 PM', '2:30 AM',
       '6:46 AM', '6:43 PM', '4:09 PM', '9:16 PM', '1:50 PM', '1:15 PM',
       '12:23 AM', '7:02 AM', '4:16 PM', '5:38 AM', '5:34 AM', '4:18 AM',
       '1:45 AM', '11:30 AM', '1:23 PM', '8:57 PM', '5:53 PM', '10:55 AM',
       '2:28 PM', '2:24 AM', '1:30 PM', '2:00 PM', '8:59 PM', '8:17 PM',
       '4:03 AM', '8:40 PM', '4:13 AM', '12:12 AM', '1:10 AM', '8:32 AM',
       '8:45 PM', '10:52 PM', '7:26 PM', '9:09 AM', '11:28 AM', '9:15 PM',
       '1:03 AM', '6:52 PM', '12:22 PM', '5:59 PM', '9:34 PM', '11:36 AM',
       '6:17 PM', '6:51 PM', '6:59 PM', '8:20 PM', '1:02 PM', '8:00 AM',
       '2:01 AM', '5:53 AM', '5:40 PM', '12:12 PM', '4:44 PM', '7:25 AM',
       '9:50 PM', '3:55 PM', '3:39 AM', '4:51 PM', '7:32 PM', '6:50 AM',
       '8:25 PM', '2:19 PM', '10:53 AM', '3:51 AM', '9:57 PM', '8:15 AM',
       '12:04 AM', '2:32 AM', '7:53 AM', '9:45 AM', '5:54 PM', '4:01 AM',
       '2:59 AM', '7:29 PM', '12:04 PM', '9:42 AM', '11:10 PM', '1:52 PM',
       '11:41 PM', '8:04 AM', '4:00 PM', '5:08 AM', '12:05 PM',
       '12:49 PM', '6:01 AM', '10:09 PM', '7:50 AM', '12:46 AM',
       '10:31 AM', '1:29 AM', '12:15 AM', '11:29 AM', '3:22 AM',
       '9:28 PM', '1:47 PM', '5:26 PM', '1:57 PM', '2:57 AM', '7:31 AM',
       '3:43 PM', '7:05 PM', '11:54 PM', '7:15 PM', '12:53 PM', '7:44 AM',
       '2:03 PM', '11:07 PM', '3:59 AM', '3:04 PM', '3:46 AM', '3:01 AM',
       '10:13 PM', '11:16 PM', '6:16 AM', '3:04 AM', '1:58 PM', '2:08 PM',
       '1:08 PM', '11:15 AM', '1:31 PM', '8:14 AM', '1:01 PM', '8:26 AM',
       '8:35 PM', '1:04 PM', '10:18 AM', '2:25 AM', '8:21 PM', '7:22 AM',
       '10:25 PM', '6:32 AM', '6:03 PM', '7:35 PM', '2:07 AM', '7:46 PM',
       '3:57 AM', '3:43 AM', '9:33 PM', '12:10 AM', '10:13 AM', '7:06 AM',
       '1:35 PM', '6:20 PM', '10:30 AM', '6:45 AM', '3:35 PM', '6:23 AM',
       '1:49 PM', '10:16 PM', '11:43 AM', '6:42 AM', '3:54 AM', '8:52 PM',
       '11:59 AM', '12:05 AM', '1:05 PM', '1:21 PM', '2:23 AM',
       '10:16 AM', '6:37 AM', '1:51 AM', '2:09 PM', '8:05 PM', '3:09 PM',
       '7:52 AM', '3:01 PM', '9:26 AM', '6:42 PM', '2:20 AM', '8:27 PM',
       '1:48 AM', '8:01 PM', '6:48 PM', '2:54 AM', '6:24 PM', '2:15 PM',
       '4:14 PM', '5:00 AM', '2:37 PM', '5:46 PM', '1:41 AM', '12:57 PM',
       '2:14 PM', '1:01 AM', '4:36 AM', '8:30 AM', '10:59 PM', '11:21 AM',
       '8:31 PM', '11:03 PM', '9:29 AM', '9:36 PM', '4:56 AM', '10:30 PM',
       '3:32 PM', '3:51 PM', '3:45 AM', '1:30 AM', '8:43 PM', '11:09 PM',
       '1:57 AM', '8:38 PM', '6:06 AM', '12:10 PM', '6:32 PM', '10:28 PM',
       '11:02 PM', '11:31 PM', '2:44 AM', '12:47 PM', '5:46 AM',
       '12:39 PM', '1:33 PM', '1:50 AM', '3:57 PM', '3:08 PM', '10:58 PM',
       '8:48 AM', '5:27 AM', '4:26 AM', '7:40 PM', '12:22 AM', '9:14 AM',
       '10:28 AM', '5:45 AM', '9:55 PM', '9:00 AM', '6:40 PM', '8:21 AM',
       '5:40 AM', '5:05 PM', '4:45 AM', '10:49 PM', '4:39 PM', '8:03 AM',
       '3:55 AM', '6:24 AM', '8:12 AM', '6:01 PM', '5:23 AM', '2:51 PM',
       '12:52 PM', '10:50 PM', '6:30 AM', '7:35 AM', '2:45 PM',
       '10:48 AM', '8:40 AM', '11:54 AM', '8:28 PM', '1:44 PM', '7:38 AM',
       '6:10 AM', '12:02 AM', '2:54 PM', '9:26 PM', '2:53 PM', '9:47 AM',
       '5:52 AM', '6:19 PM', '9:17 PM', '8:33 AM', '3:52 PM', '1:03 PM',
       '12:29 AM', '2:47 PM', '6:19 AM', '12:26 AM', '11:38 PM',
       '4:16 AM', '5:34 PM', '9:11 AM', '3:56 AM', '9:17 AM', '9:15 AM',
       '1:25 AM', '2:43 AM', '3:06 AM', '1:48 PM', '7:07 PM', '10:18 PM',
       '7:22 PM', '8:23 PM', '12:01 AM', '12:54 AM', '12:59 PM',
       '5:43 PM', '10:42 AM', '11:47 AM', '10:54 PM', '6:40 AM',
       '5:49 AM', '3:14 PM', '9:48 PM', '6:36 AM', '9:27 AM', '11:20 AM',
       '9:50 AM', '1:22 PM', '7:12 PM', '7:51 PM', '8:02 AM', '10:54 AM',
       '7:39 PM', '3:28 PM', '4:21 PM', '11:04 PM', '1:11 PM', '4:56 PM',
       '10:05 AM', '1:17 PM', '7:51 AM', '7:36 PM', '12:17 PM', '7:32 AM',
       '3:11 AM', '10:07 AM', '12:37 AM', '10:38 PM', '9:59 AM',
       '7:24 PM', '6:58 AM', '8:11 AM', '1:42 PM', '2:48 AM', '9:16 AM',
       '9:10 PM', '6:33 PM', '9:03 PM', '3:50 PM', '5:47 AM', '9:53 PM',
       '3:30 AM', '3:36 AM', '1:32 PM', '2:34 PM', '5:11 PM', '5:35 PM',
       '6:50 PM', '7:55 PM', '9:06 PM', '3:41 PM', '7:11 AM', '8:09 PM',
       '8:39 AM', '4:34 AM', '9:18 PM', '10:24 AM', '3:45 PM', '6:57 PM',
       '11:24 AM', '8:04 PM', '9:31 AM', '3:42 AM', '3:09 AM', '12:17 AM',
       '4:29 AM', '11:46 PM', '8:18 PM', '12:08 AM', '6:14 PM', '3:17 AM',
       '11:09 AM', '4:34 PM', '6:28 AM', '3:19 AM', '7:14 PM', '11:23 AM',
       '12:01 PM', '11:15 PM', '5:06 AM', '5:02 AM', '10:20 PM',
       '5:31 AM', '7:37 PM', '2:34 AM', '10:57 PM', '10:09 AM', '6:00 PM',
       '11:13 PM', '11:59 PM', '5:17 PM', '3:58 AM', '1:15 AM', '3:47 PM',
       '1:24 AM', '2:23 PM', '5:11 AM', '11:03 AM', '8:22 AM', '6:38 AM',
       '12:30 PM', '12:19 PM', '1:20 AM', '3:21 PM', '4:06 PM', '1:37 AM',
       '6:08 PM', '10:49 AM', '10:11 PM', '12:21 AM', '9:19 AM',
       '10:00 AM', '5:22 PM', '1:40 PM', '5:39 AM', '6:44 PM', '10:33 AM',
       '9:58 PM', '7:02 PM', '2:38 AM', '1:40 AM', '11:02 AM', '2:03 AM',
       '6:07 PM', '12:41 PM', '7:56 PM', '6:56 PM', '10:04 AM', '7:12 AM',
       '7:36 AM', '3:25 AM', '6:10 PM', '6:55 PM', '2:42 PM', '5:07 PM',
       '9:37 AM', '12:23 PM', '7:07 AM', '6:31 AM', '2:53 AM', '6:37 PM',
       '9:19 PM', '12:35 AM', '4:40 PM', '2:09 AM', '5:13 AM', '1:26 AM',
       '1:12 PM', '3:36 PM', '9:51 AM', '1:36 AM', '6:53 PM', '4:32 AM',
       '1:00 AM', '4:17 AM', '5:44 AM', '6:02 PM', '7:28 AM', '8:16 PM',
       '11:18 PM', '3:07 AM', '3:23 PM', '4:04 AM', '12:32 AM', '2:04 AM',
       '8:42 PM', '5:32 AM', '3:41 AM', '11:12 PM', '6:29 PM', '3:38 PM',
       '2:49 AM', '1:46 PM', '11:11 PM', '5:48 AM', '6:39 PM', '3:18 AM',
       '3:24 AM', '1:04 AM', '6:22 AM', '6:26 AM', '11:32 PM', '8:01 AM',
       '6:52 AM', '3:05 AM', '7:43 PM', '12:08 PM', '10:04 PM', '6:35 AM',
       '12:45 AM', '5:41 PM', '3:08 AM', '8:08 PM', '1:39 AM', '5:41 AM',
       '9:06 AM', '7:03 PM', '4:55 AM', '10:55 PM', '4:41 PM', '12:00 AM',
       '4:17 PM', '3:22 PM', '2:27 AM', '9:46 PM', '9:25 AM', '2:06 PM',
       '12:18 PM', '6:11 PM', '5:18 AM', '11:39 AM', '2:12 PM', '5:04 PM',
       '4:48 PM', '11:16 AM', '10:34 AM', '4:44 AM', '12:52 AM',
       '8:36 PM', '8:41 PM', '6:55 AM', '12:27 PM', '10:17 AM', '2:30 PM',
       '3:12 AM', '2:41 PM', '3:02 PM', '12:26 PM', '7:54 AM', '6:04 AM',
       '8:53 AM', '6:27 PM', '10:42 PM', '7:40 AM', '2:02 PM', '1:16 AM',
       '8:47 AM', '6:28 PM', '11:05 AM', '4:15 AM', '6:15 AM', '2:17 AM',
       '3:00 AM', '3:58 PM', '10:40 PM', '10:37 AM', '6:05 PM', '4:11 AM',
       '7:13 PM', '11:08 PM', '3:39 PM', '8:52 AM', '9:04 PM', '4:32 PM',
       '10:40 AM', '5:01 PM', '10:10 AM', '12:39 AM', '3:18 PM',
       '4:52 PM', '7:52 PM', '12:49 AM', '8:31 AM', '11:12 AM', '4:10 PM',
       '12:34 PM', '5:36 PM', '11:38 AM', '9:14 PM', '8:44 AM',
       '10:23 PM', '4:53 PM', '10:56 AM', '12:40 PM', '5:23 PM',
       '9:38 AM', '8:24 AM', '12:44 PM', '3:07 PM', '1:24 PM', '8:08 AM',
       '11:42 AM', '5:19 AM', '3:17 PM', '5:33 AM', '12:51 AM', '1:26 PM',
       '4:43 AM', '2:35 AM', '11:34 PM', '9:37 PM', '8:00 PM', '1:31 AM',
       '5:19 PM', '3:10 PM', '10:27 PM', '8:54 PM', '2:49 PM', '6:31 PM',
       '10:05 PM', '5:42 AM', '6:41 AM', '12:57 AM', '10:35 PM',
       '8:10 PM', '7:04 AM', '9:34 AM', '4:58 PM', '8:35 AM', '3:53 PM',
       '5:47 PM', '4:45 PM'], dtype=object)

In [10]:
emp['Salary'].unique()

array([ 97308,  61933, 130590, 138705, 101004, 115163,  65476,  45906,
        95570, 139852,  63241, 102508, 112807, 109831,  41426,  59414,
        90370, 111737, 132940,  81014,  64714, 100612,  90816, 125792,
        97950,  37076,  37598, 122367, 124008,  79529, 118780,  88657,
       122340, 119082,  95734,  85182, 142032,  57427,  36844, 122173,
        99283,  66582, 121918,  73524, 145146,  88010, 114796,  66820,
        93581, 113590,  94976,  41126,  49339,  40341,  83677, 102488,
       130276,  64715,  72670,  66851,  48866, 106862,  58112,  35203,
        77834,  61310, 125250,  51178,  84834, 100863,  84692, 118172,
        54043,  90582,  62096, 104897, 131604, 107391, 114797, 115814,
       137126,  47369,  35095, 148115,  83072, 100238, 103495, 144887,
        64088,  51082,  91719, 128771, 119009, 111858, 130620,  43026,
       142321, 140371, 100705,  77544,  48109,  61602, 103902, 136984,
        80740,  91712,  42146,  68680, 133980,  37919, 147113,  42153,
        64363, 114767,  58698,  54585,  76189, 109095, 120204,  41054,
        84885, 119735, 110169,  73789,  76078,  49368,  57325,  66521,
       127654,  60866,  41334,  94231, 146670, 106317, 109260, 134148,
        43542,  95327, 112238, 132373, 113850, 110194, 146129, 140013,
       122717,  71715,  95322,  89227, 124488,  86230, 135490, 121333,
       129297,  84546,  85730, 104058, 105062,  79536, 114412,  68501,
       149563, 103386,  89786,  52226, 134645,  59148,  42341, 142178,
        38989,  53754, 133772, 143499,  97058,  85446,  40297, 146651,
       124486, 102652, 144474,  68759,  57286,  58129, 123940,  98233,
       140810,  42090, 149654,  51430,  71749,  85700,  57783,  36946,
        99326, 109259, 131038, 121068,  62719,  69268,  36067, 130581,
        89661,  36643, 140558, 103521,  55281, 115711, 114079,  57531,
       141069,  89434,  44639, 110967, 115387,  81673, 109588,  92544,
       142373,  83341,  98865, 120444,  71945, 109564,  78417, 106947,
        87298,  64579,  50905,  59728,  51685,  49542,  38375,  64084,
       147663,  73935,  40837,  94393,  42087,  52080,  35061,  64164,
        94088, 127813,  38041, 126310, 142561,  70817,  59937, 106115,
        82782, 104896, 133943,  83658,  71896, 113732, 110485, 115118,
        48696,  42676,  43586,  89258,  90730, 100308,  69134,  58295,
        50141, 101941, 115145,  40451,  56526, 145316, 103235,  58563,
        74129,  74669,  97490, 104250,  94345,  82439,  51613, 105946,
        46080, 134610, 125104, 107281, 141521,  65931,  69989, 147183,
        66757,  75145, 129460, 132839,  44537, 118733,  46905,  79582,
        55394, 123811, 137314,  36711, 111786,  72257,  71276,  38712,
        46930, 125220, 121477,  86386,  81308,  84810,  66775,  72145,
       121604, 109510, 112117, 108127, 123711, 132381, 148225, 145988,
        62960,  56926,  41428, 115658,  76707,  60388,  45150,  58755,
        76076,  87760, 135119,  36759, 121723, 110061,  85074,  85799,
        75150,  91344,  86326,  98753, 113060,  77327,  62666,  96633,
        58248,  83706,  74086,  95389, 129968, 140347,  41549,  74287,
        69906,  65078, 106406, 115913,  38092, 121160,  90429,  64207,
        80688,  55044,  72893,  96978,  97364, 140885,  58520,  66067,
        87721, 144001,  91133,  67827,  81839,  81444, 137661, 112548,
       111249, 114334, 118906,  72979,  64172, 107024,  50167, 106995,
        70492, 125881, 123294, 131045,  97635,  94493, 140502, 106310,
        46240, 111163,  93753,  63494, 116693,  85215,  86439,  62913,
        38872, 124655, 113506, 109980,  91522,  42214,  83159, 144082,
        47885, 126232, 134598,  66604, 115194,  49101,  67811, 111043,
        37748,  36403, 140136, 121508,  79906, 123144,  46953,  79443,
        51395, 134408,  71853,  68028, 149903,  79123, 104014,  65362,
        50701, 144709,  53061,  36697,  69244, 101036,  52119,  46666,
        73437,  86318,  76409,  71642,  67150, 142208,  81183, 107163,
        55038, 140002, 146812,  40119, 136602,  69579, 101457, 121232,
       102626, 137171,  88276,  43354, 125556,  59862,  74640,  52875,
        58789, 122897, 136032, 141958, 139917, 147635,  68230, 124365,
       104749, 122121, 143541, 137840,  73354,  47647, 106249,  93847,
       104815, 115436,  50645, 142415,  37984,  71751, 135882,  46007,
       117055,  58478, 121357,  44857,  47322,  81077,  76394, 114356,
        41831,  90187,  72613,  42748,  37259, 125033,  38275,  71520,
       106472, 103684,  96111,  90719, 140303,  62161,  78883,  63549,
        63888,  97370,  66224,  97915,  86883,  37812,  56580,  83895,
        58047, 124889, 118840,  67780, 144677,  45724,  86676,  82401,
        35575, 123649,  38078,  52620, 133366,  91462, 146589,  51633,
        45181,  62454,  84746, 147362,  80803, 117293, 105689,  93302,
       102555,  51525,  41190,  75484,  82726, 122319, 127297, 109290,
        99150,  71930,  66819,  42424,  51431, 120675,  96610,  71430,
        87713,  86723,  43414,  87145,  91124,  48141,  90829, 101262,
        41427,  56993, 114244,  81800, 118736,  66077,  35013,  98393,
       107111,  65673,  65482,  81919,  59277,  49501,  70367, 132156,
        56961,  98841,  78226, 116931,  87575, 110924,  78351, 125574,
        95198, 121006,  95728,  69740,  91996,  98385,  90556,  50366,
        84232, 100888, 141335,  97691,  47266, 139754, 116236, 103405,
        41453,  52730,  60361,  63103,  65168,  73105,  37916,  45682,
        69297,  59070,  81215, 128036,  89780, 125018, 133033,  82408,
       131755, 128305, 147309,  74911,  47079,  82873, 134673, 123591,
        75598,  89831,  92430, 126956, 112467,  46665,  42553, 102081,
       135118,  71975, 149908,  45418,  79145, 122920, 128031,  59969,
        35381, 113129, 141932,  42296,  63395, 125382, 113592,  46750,
        90285,  53692, 100341, 123876,  41643, 113760,  49473, 146141,
        79459, 104496,  67789,  86564, 135758,  84672, 111580,  50455,
        88733, 130577, 138925,  62371,  87715,  66029,  86818,  75147,
       105573,  41230, 117787,  88086, 139959,  93901,  50529, 134988,
       120941, 118753,  92799,  85718, 109517,  85550, 136655,  43312,
       102839,  78891,  93201,  84693,  73587,  65251, 129148, 128175,
        75825,  51821,  60411,  58327,  46478, 123963,  79796,  83809,
        77933,  51070,  97480,  58357,  67165, 147417,  95003, 144187,
        37888, 131513,  77287,  46875,  82744,  43252,  66047, 118431,
        59943, 136681, 138807,  82884,  48668, 122971, 107050, 138598,
       149456, 128540,  61117, 100949,  46829,  69111,  46602,  61181,
        94963,  85789, 145274, 102841,  49665,  41928, 128042,  86150,
       121816, 123409,  98295,  59678,  57871, 132084,  35633, 125298,
       115582, 148339, 112975,  36927,  70248, 141305,  72002, 102577,
       113554,  47176, 106428,  75181,  79047,  52970, 137979, 114360,
       110306,  46378,  74104, 132505,  96649,  57811, 111468, 141498,
       124441,  40121, 129712, 126010, 122762, 149105,  44021,  42025,
        59970, 145001, 102589,  47529, 148941,  91109,  51923,  53954,
        39335, 111371, 115057, 145357,  36749,  89854, 134048, 141311,
       123621,  54941, 106562,  39371,  83112,  96941,  47232,  54058,
        80399, 118043, 109411,  97566,  69267,  87103,  98811, 149684,
        71383,  81206,  69112, 120672,  96511,  49325, 132175, 118037,
       139570, 115280,  51065, 103854,  48354, 132327, 106362, 148857,
       131131, 129663,  41449,  93368,  53335, 148291, 147842, 105066,
       139284,  63046,  89700, 108946,  98406, 108581,  41808,  36837,
       140850,  50426, 134120,  57292,  80633, 131943,  48046,  97443,
       135352, 107816,  96329,  73749,  75607,  98858,  76485,  41238,
       114896, 125418,  75415,  90998, 142868, 135990,  57300,  73706,
        85871,  96795,  92242, 115149, 126924, 145329,  92587,  60263,
        91406,  37005, 139791,  45267,  95296,  59680, 144701,  35477,
       119266, 103877,  47605, 136604, 121250,  35884, 137144, 102697,
        61999,  45223,  54033, 126120,  99747,  71958, 115566, 118369,
        51667,  85858, 131423,  49538,  50369,  86615, 135369,  60003,
        95866, 109324, 103557, 111376,  75661,  85213, 140444,  90427,
       141439,  43694, 131952,  96250,  63126,  44836,  70635, 137386,
       104840,  75498,  67471, 101914,  93712, 133472, 107351, 142410,
        37385,  58423, 143638, 113425,  57266, 119667, 127118,  80838,
        70990,  39833,  45094,  93997, 103050, 121797,  89443,  35802,
        68164,  93022, 105681,  43050,  44486,  63571,  75423,  76381,
       137359,  67656,  92436, 137954, 124566,  66146, 142935,  46233,
       148985,  91411, 146907,  43455,  85668,  82871, 136709,  47638,
        38344, 100765, 134505, 112769,  56450,  98874, 132483,  42392,
        96914,  60500, 129949])

In [11]:
emp['Bonus %'].unique()

array([ 6.945,  4.17 , 11.858,  9.34 ,  1.389, 10.125, 10.012, 11.598,
       18.523,  7.524, 15.132, 12.637, 17.492,  5.831, 14.543,  1.256,
        7.369,  6.414, 19.082,  1.894,  4.934, 13.645, 18.816,  5.042,
       13.873, 18.576,  7.757,  5.218, 13.464,  7.008,  9.096, 12.752,
        6.417, 16.18 , 19.096, 16.675, 12.599,  9.557,  5.574,  7.797,
        2.665, 11.308, 15.835,  5.207,  7.482, 13.886,  6.796,  9.   ,
        6.083,  3.055, 13.83 , 14.009,  1.695, 17.578,  8.999, 17.653,
       16.084, 15.107,  1.481, 11.279,  4.271,  3.699, 19.414, 18.04 ,
       18.771, 12.428,  2.672,  9.735, 14.33 ,  4.382,  6.617, 16.194,
        3.833,  4.709, 17.029,  5.118,  7.353,  1.26 ,  5.965,  4.99 ,
       15.602, 14.822,  8.379,  6.539,  7.511,  3.887, 17.29 ,  8.276,
        6.155, 11.955, 11.583,  8.309, 12.506,  1.601,  7.03 , 14.166,
        1.737, 10.62 , 16.961, 12.447, 14.995, 11.849, 12.159,  8.932,
       19.305,  8.567,  3.046, 16.565, 12.396, 11.449, 16.135,  8.454,
        4.023,  3.711,  6.811,  4.166, 18.988,  9.494, 12.299, 15.402,
       18.74 , 13.892, 14.841,  2.401, 14.226, 17.179,  5.83 , 16.439,
       13.101,  6.219, 17.517, 10.763,  2.235,  2.65 ,  8.833, 19.687,
       15.12 ,  6.03 , 10.527,  1.854, 14.727,  5.687,  8.689, 12.452,
       13.079,  4.15 ,  3.996, 14.837,  8.578, 19.934, 15.295,  8.067,
       10.489,  5.359, 17.695,  1.563, 14.443,  8.756, 14.316, 16.991,
       11.451, 14.422, 19.135, 18.197,  9.061,  7.014, 17.984,  7.017,
        5.455, 19.02 , 17.495,  9.402,  3.959,  6.185,  1.451, 10.166,
       14.085, 17.648, 19.343,  5.025,  1.952, 12.184,  2.518,  9.177,
        8.842,  1.825,  6.46 , 15.931,  1.215,  9.129,  6.652, 16.475,
        4.443,  8.996, 12.757, 19.127,  3.031,  9.64 , 16.736,  8.525,
        7.953,  5.084,  2.784,  4.935,  8.012,  8.399,  1.767,  4.903,
       11.295,  9.148, 19.612,  1.821, 15.364,  3.55 ,  3.8  ,  2.462,
        1.015, 10.628,  7.768,  5.56 ,  3.845,  3.067, 15.866,  2.311,
       15.266,  9.404, 11.226, 17.445,  1.679, 17.018, 10.263, 14.752,
       12.182,  3.643,  2.624,  9.375,  5.128, 17.612, 19.107,  5.961,
       18.428,  5.413,  8.866, 17.138, 12.045,  3.742,  4.366, 19.55 ,
        8.94 ,  6.513,  4.232, 10.391,  7.995,  5.108,  4.75 , 15.517,
       12.659, 15.585,  2.491, 13.677,  3.723, 14.603, 13.218,  3.45 ,
       14.063, 16.044,  5.81 , 18.517,  9.554, 12.062, 18.225,  1.113,
        5.46 , 18.456, 11.996, 19.062, 12.984,  1.139,  9.635,  6.147,
       12.345,  1.612,  4.337,  2.304, 10.985,  9.999, 18.099,  6.388,
       13.657, 17.463, 18.284,  9.653, 19.154,  3.873,  3.18 ,  7.664,
        4.542, 19.028,  3.592, 13.023,  5.027,  3.657, 18.702,  3.733,
       17.44 ,  2.937,  2.196, 15.794,  2.158, 13.448,  1.923, 13.457,
        6.338, 15.858, 10.966,  8.34 ,  1.841, 18.243, 14.356,  7.507,
       14.372,  3.041,  6.031, 17.885, 12.075,  5.097,  5.319, 14.987,
        7.887, 17.269, 18.645,  7.494,  1.844, 19.93 ,  4.035, 10.717,
       16.443,  2.846, 11.58 , 10.247,  3.914,  6.96 ,  5.778, 14.223,
       19.897,  8.723,  3.95 , 10.751,  4.844,  3.095,  1.782, 12.121,
        5.668,  7.843,  4.45 ,  7.824, 18.892,  4.078,  9.555, 13.865,
        3.595, 16.231, 10.957,  8.748, 12.484,  2.194,  5.14 , 19.717,
       12.072,  3.171,  4.805,  4.664, 10.574,  9.669,  4.537,  5.66 ,
       10.894,  2.362, 15.723,  8.895, 16.697, 19.894, 11.312, 10.413,
       13.443,  9.989,  4.03 ,  6.976,  7.094, 19.385, 13.835,  7.425,
        7.799, 18.241,  9.302, 14.272, 19.642,  8.86 ,  7.564, 17.538,
        9.55 ,  1.62 , 19.276,  6.191, 11.699, 14.609,  5.861, 11.9  ,
       12.699,  5.966,  9.047,  2.664,  3.12 , 19.334, 18.021, 16.261,
       17.436, 14.637,  2.378,  3.56 ,  8.037,  7.869,  5.63 , 19.422,
        7.077, 12.993,  7.132, 14.227, 10.069, 11.864, 11.196,  6.22 ,
        2.826, 11.343,  1.886, 18.492,  1.496, 15.85 , 11.204, 17.066,
        3.665, 19.691, 19.49 ,  1.965,  4.338, 10.429, 18.029,  6.662,
       16.624, 15.843, 14.248, 13.946,  7.996,  3.269, 18.641,  4.188,
        5.461,  8.222, 10.696,  9.078, 11.466, 14.693,  8.047,  8.457,
       11.364,  7.937,  8.461,  9.705, 18.357, 18.787, 15.967,  1.085,
        3.38 ,  3.099, 11.119,  1.985,  2.021, 15.918, 19.944, 19.731,
        7.461,  6.525, 18.845, 13.266,  7.25 ,  2.117,  5.437,  7.123,
        4.548, 14.764, 11.126,  9.765,  1.763,  4.887, 10.494, 13.248,
        6.499, 18.654, 15.592, 17.07 ,  8.13 , 19.695, 19.624, 18.115,
       10.458, 15.979,  3.997, 18.003,  3.178,  8.411, 17.971, 14.858,
       15.026, 14.509,  9.54 ,  8.696,  1.022,  7.175,  7.252, 14.595,
       10.154, 10.28 , 13.773, 12.292,  8.205,  4.905, 13.472,  3.491,
        3.459,  4.82 ,  7.851, 14.077,  2.366, 13.32 ,  9.048,  3.672,
       10.366,  3.311,  3.186, 16.304, 19.122, 11.905, 13.853,  6.007,
       18.451,  6.639, 13.295,  6.51 ,  2.097,  8.572, 18.863, 14.842,
        7.563, 17.33 , 12.986, 12.605, 19.142,  6.773,  1.431, 18.623,
       16.69 ,  5.435,  7.421,  5.809, 14.879, 11.393,  1.438,  1.187,
       18.089, 15.118, 10.2  , 13.506, 18.266,  2.754,  7.585,  8.945,
        2.419,  9.657, 13.346,  7.808, 15.221,  4.644,  2.075,  3.512,
        6.752,  8.294, 11.506, 10.925, 15.749,  9.862, 15.704, 12.49 ,
       15.427,  2.142, 10.256, 12.74 , 17.274, 15.91 , 10.084, 12.525,
        7.099, 11.378, 11.513, 12.929,  1.268, 19.064,  8.4  , 18.824,
        9.601, 12.2  ,  8.701,  2.93 , 16.636,  1.702, 19.513,  2.617,
        1.869,  6.878,  6.5  , 19.289, 13.047,  2.924, 18.396,  1.433,
       19.391,  3.756,  5.203, 15.108,  9.77 , 18.912, 10.162, 19.78 ,
        5.32 , 15.857, 14.064, 11.749, 17.371,  1.017, 16.922, 11.411,
       13.613, 17.108, 11.367, 13.591,  4.785,  4.225,  4.659, 12.866,
       12.463,  3.645,  7.776, 14.771, 17.105, 11.879, 14.782,  3.96 ,
       10.982, 16.248,  1.932, 12.791,  9.801, 15.77 ,  2.675,  3.345,
       14.301, 17.398,  5.268,  6.611, 10.485, 19.387, 18.704,  8.992,
       17.821, 17.263, 13.926,  3.694,  8.162,  2.782, 13.326,  5.146,
       11.593,  8.218, 10.385,  7.927, 11.712,  9.769, 11.211, 15.193,
       18.473,  7.839,  1.197, 12.048, 17.095, 16.552, 15.745,  9.851,
       12.922, 13.132, 13.806, 11.518,  7.969, 13.001, 18.685, 11.626,
        5.197, 11.416, 13.47 ,  1.876, 13.   , 12.942, 19.111, 18.674,
       12.772,  1.432,  3.655,  1.4  ,  6.837, 11.716, 14.618, 12.737,
       14.737,  3.533, 15.941,  2.844, 13.813,  5.19 , 14.625,  1.027,
       16.559, 19.626,  9.712, 16.379,  3.369, 18.338,  5.478,  2.03 ,
       10.615,  7.783,  7.617, 10.895,  4.02 , 10.006,  3.947,  3.019,
       15.343, 11.479,  9.699, 18.769,  9.66 ,  9.849, 13.178, 12.026,
       18.018, 10.736, 10.867,  6.06 , 18.784,  4.513,  5.266, 17.799,
       16.843,  9.127, 17.68 , 13.592,  3.453,  8.941,  2.58 ,  4.135,
       16.353,  6.293, 11.058, 19.601,  9.564, 13.707, 10.286,  3.319,
       12.801, 19.85 , 17.952,  2.712, 11.517, 17.499, 13.623, 19.075,
       10.664, 15.081,  6.081,  2.089, 19.754,  7.227,  6.818, 19.767,
        3.221,  4.   ,  4.068,  4.083, 10.048, 17.862,  5.182, 12.254,
        7.266,  2.147,  5.89 ,  5.665,  7.487,  7.864, 19.908,  7.588,
       19.467,  9.331,  2.071,  2.28 , 13.492, 15.804,  9.153, 16.807,
        4.924, 19.501, 19.264,  8.965,  8.738, 11.682, 15.574,  4.707,
        2.88 ,  9.192,  6.002, 16.158, 17.343, 11.39 , 10.411,  2.277,
       12.211,  7.943,  9.634, 19.239, 14.66 , 18.855, 18.536,  6.842,
        6.01 , 16.306, 14.249,  7.737,  7.986, 18.751,  2.469, 19.332,
        4.299,  3.525,  9.212,  8.219, 13.823,  8.064, 19.132,  8.382,
        6.318, 14.344, 18.015, 18.53 ,  9.16 , 15.407, 11.934,  1.552,
        7.1  ,  8.475,  2.709,  5.681,  7.645, 16.968,  3.942, 10.146,
       15.211, 16.323, 18.178,  6.911,  6.322, 14.955,  6.16 ,  4.363,
       17.667, 10.081,  3.283,  6.466,  8.879, 15.528,  1.02 ,  6.168,
        5.272,  6.716,  7.696,  6.339, 19.475,  8.957,  9.828, 18.9  ,
        3.412,  4.38 ,  9.624, 19.388, 19.488, 16.014,  2.673,  1.079,
        2.386,  3.771,  2.01 ,  3.799,  3.787, 12.09 , 10.056, 18.424,
        2.657,  8.611, 15.653,  6.537,  2.728,  1.905, 17.426, 16.941,
        5.329, 11.048,  8.226, 10.833,  9.662, 11.907,  1.148, 11.176,
        8.115, 15.901,  9.631,  5.85 , 18.093,  3.05 , 16.923, 17.94 ,
       12.391, 18.393,  9.146, 19.572, 11.671, 17.308, 15.397,  5.368,
       11.159, 11.105, 16.455, 12.467,  4.195,  5.949, 11.178, 13.198,
        8.862, 19.28 ,  8.639, 11.738, 13.04 ,  1.909, 17.999, 10.331,
       11.209,  3.794, 11.051, 11.625, 19.04 ,  4.479, 16.655, 19.675,
        1.421, 11.985, 10.169])

In [12]:
emp['Senior Management'].unique()

array([True, False, nan], dtype=object)

In [13]:
emp['Team'].unique()

array(['Marketing', nan, 'Finance', 'Client Services', 'Legal', 'Product',
       'Engineering', 'Business Development', 'Human Resources', 'Sales',
       'Distribution'], dtype=object)

In [14]:
backup = emp.copy()

In [15]:
emp[emp['First Name'].isna()]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
7,NaN,Female,7/20/2015,10:43 AM,45906,11.598,NaN,Finance
23,NaN,Male,6/14/2012,4:19 PM,125792,5.042,NaN,NaN
25,NaN,Male,10/8/2012,1:12 AM,37076,18.576,NaN,Client Services
32,NaN,Male,8/21/1998,2:27 PM,122340,6.417,NaN,NaN
39,NaN,Male,1/29/2016,2:33 AM,122173,7.797,NaN,Client Services
...,...,...,...,...,...,...,...,...
902,NaN,Male,5/23/2001,7:52 PM,103877,6.322,NaN,Distribution
925,NaN,Female,8/23/2000,4:19 PM,95866,19.388,NaN,Sales
946,NaN,Female,9/15/1985,1:50 AM,133472,16.941,NaN,Distribution
947,NaN,Male,7/30/2012,3:07 PM,107351,5.329,NaN,Marketing
951,NaN,Female,9/14/2010,5:19 AM,143638,9.662,NaN,NaN

In [16]:
emp[~emp['First Name'].isna()]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [17]:
emp = emp[~emp['First Name'].isna()]

In [19]:
emp = emp[~emp['Gender'].isna()]

In [20]:
emp[emp['Start Date'].isna()]

Empty DataFrame
Columns: [First Name, Gender, Start Date, Last Login Time, Salary, Bonus %, Senior Management, Team]
Index: []

In [30]:
emp = emp[~emp['Team'].isna()]

In [31]:
emp['Team'].unique()

array(['Marketing', 'Finance', 'Client Services', 'Legal', 'Product',
       'Engineering', 'Business Development', 'Human Resources', 'Sales',
       'Distribution'], dtype=object)

In [32]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
Index: 764 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         764 non-null    object
 1   Gender             764 non-null    object
 2   Start Date         764 non-null    object
 3   Last Login Time    764 non-null    object
 4   Salary             764 non-null    int64
 5   Bonus %            764 non-null    float64
 6   Senior Management  764 non-null    object
 7   Team               764 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 53.7+ KB

In [33]:
emp['First Name'] = emp['First Name'].astype('string')

In [34]:
emp['Gender'] = emp['Gender'].astype('category')

In [35]:
emp['Start Date'] = pd.to_datetime(emp['Start Date'], errors='coerce')  # 'coerce' handles invalid dates

In [37]:
emp['Last Login Time'].head(10)

0    2025-11-02 12:42:00
2    2025-11-02 11:17:00
3    2025-11-02 13:00:00
4    2025-11-02 16:47:00
5    2025-11-02 01:35:00
6    2025-11-02 16:20:00
8    2025-11-02 06:29:00
9    2025-11-02 06:51:00
11   2025-11-02 15:19:00
12   2025-11-02 01:08:00
Name: Last Login Time, dtype: datetime64[ns]

In [38]:
emp['Last Login Time'] = pd.to_datetime(emp['Last Login Time'],format='%Y-%m-%d %H:%M:%S',errors='coerce')

In [39]:
emp['Senior Management'] = emp['Senior Management'].astype('bool')

In [40]:
emp['Team'] = emp['Team'].astype('category')

In [41]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
Index: 764 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         764 non-null    string
 1   Gender             764 non-null    category
 2   Start Date         764 non-null    datetime64[ns]
 3   Last Login Time    764 non-null    datetime64[ns]
 4   Salary             764 non-null    int64
 5   Bonus %            764 non-null    float64
 6   Senior Management  764 non-null    bool
 7   Team               764 non-null    category
dtypes: bool(1), category(2), datetime64[ns](2), float64(1), int64(1), string(1)
memory usage: 38.5 KB

In [42]:
emp = emp.reset_index(drop = True)

In [43]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 764 entries, 0 to 763
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         764 non-null    string
 1   Gender             764 non-null    category
 2   Start Date         764 non-null    datetime64[ns]
 3   Last Login Time    764 non-null    datetime64[ns]
 4   Salary             764 non-null    int64
 5   Bonus %            764 non-null    float64
 6   Senior Management  764 non-null    bool
 7   Team               764 non-null    category
dtypes: bool(1), category(2), datetime64[ns](2), float64(1), int64(1), string(1)
memory usage: 32.7 KB

In [44]:
emp.describe()

,Start Date,Last Login Time,Salary,Bonus %
count,764,764,764.000000,764.000000
mean,1999-03-10 06:30:09.424083712,2025-11-02 11:47:42.015706624,90433.196335,10.148041
min,1980-01-19 00:00:00,2025-11-02 00:01:00,35013.000000,1.015000
25%,1990-12-03 12:00:00,2025-11-02 05:56:45,62071.750000,5.193250
50%,1999-11-14 00:00:00,2025-11-02 11:48:00,90428.000000,9.658500
75%,2008-01-29 18:00:00,2025-11-02 17:48:30,118075.250000,14.965000
max,2016-06-16 00:00:00,2025-11-02 23:57:00,149908.000000,19.944000
std,NaN,NaN,32864.665282,5.608733

In [45]:
emp['Start Date'].sort_values().head(5)

723   1980-01-19
665   1980-01-28
207   1980-02-20
421   1980-02-25
612   1980-03-08
Name: Start Date, dtype: datetime64[ns]

In [46]:
emp.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2025-11-02 12:42:00,97308,6.945,True,Marketing
1,Maria,Female,1993-04-23,2025-11-02 11:17:00,130590,11.858,False,Finance
2,Jerry,Male,2005-03-04,2025-11-02 13:00:00,138705,9.340,True,Finance
3,Larry,Male,1998-01-24,2025-11-02 16:47:00,101004,1.389,True,Client Services
4,Dennis,Male,1987-04-18,2025-11-02 01:35:00,115163,10.125,False,Legal

In [47]:
emp = emp.sort_values(by='Start Date')

In [48]:
emp.head(10)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
723,Joe,Male,1980-01-19,2025-11-02 16:06:00,119667,1.148,True,Finance
665,Ruby,Female,1980-01-28,2025-11-02 23:08:00,142868,6.318,False,Marketing
207,Fred,Male,1980-02-20,2025-11-02 02:25:00,74129,18.225,False,Product
421,Sara,Female,1980-02-25,2025-11-02 22:50:00,75484,3.186,False,Finance
612,Julie,Female,1980-03-08,2025-11-02 05:13:00,145357,3.459,False,Engineering
61,Steven,Male,1980-03-30,2025-11-02 21:20:00,35095,8.379,True,Client Services
33,Roger,Male,1980-04-17,2025-11-02 11:32:00,88010,13.886,True,Sales
732,Bruce,Male,1980-05-07,2025-11-02 20:00:00,35802,12.391,True,Sales
454,Cynthia,Female,1980-05-23,2025-11-02 03:19:00,78226,2.419,False,Human Resources
165,Evelyn,Female,1980-05-24,2025-11-02 23:10:00,81673,15.364,True,Engineering

In [49]:
emp = emp.reset_index(drop = True)

In [50]:
emp.head(10)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Joe,Male,1980-01-19,2025-11-02 16:06:00,119667,1.148,True,Finance
1,Ruby,Female,1980-01-28,2025-11-02 23:08:00,142868,6.318,False,Marketing
2,Fred,Male,1980-02-20,2025-11-02 02:25:00,74129,18.225,False,Product
3,Sara,Female,1980-02-25,2025-11-02 22:50:00,75484,3.186,False,Finance
4,Julie,Female,1980-03-08,2025-11-02 05:13:00,145357,3.459,False,Engineering
5,Steven,Male,1980-03-30,2025-11-02 21:20:00,35095,8.379,True,Client Services
6,Roger,Male,1980-04-17,2025-11-02 11:32:00,88010,13.886,True,Sales
7,Bruce,Male,1980-05-07,2025-11-02 20:00:00,35802,12.391,True,Sales
8,Cynthia,Female,1980-05-23,2025-11-02 03:19:00,78226,2.419,False,Human Resources
9,Evelyn,Female,1980-05-24,2025-11-02 23:10:00,81673,15.364,True,Engineering

In [51]:
emp

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Joe,Male,1980-01-19,2025-11-02 16:06:00,119667,1.148,True,Finance
1,Ruby,Female,1980-01-28,2025-11-02 23:08:00,142868,6.318,False,Marketing
2,Fred,Male,1980-02-20,2025-11-02 02:25:00,74129,18.225,False,Product
3,Sara,Female,1980-02-25,2025-11-02 22:50:00,75484,3.186,False,Finance
4,Julie,Female,1980-03-08,2025-11-02 05:13:00,145357,3.459,False,Engineering
...,...,...,...,...,...,...,...,...
759,Thomas,Male,2016-03-12,2025-11-02 15:10:00,105681,19.572,False,Engineering
760,Janice,Female,2016-03-12,2025-11-02 00:40:00,51082,11.955,False,Legal
761,Todd,Male,2016-03-16,2025-11-02 14:45:00,134408,3.560,True,Human Resources
762,Lillian,Female,2016-06-05,2025-11-02 06:09:00,59414,1.256,False,Product
763,Tina,Female,2016-06-16,2025-11-02 19:47:00,100705,16.961,True,Marketing

In [52]:
emp.to_csv('Clened_emp.csv')